---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.GetExportLinetypeTable
source: html/eba17284-95da-cea8-6b24-4e99bf196629.htm
---
# Autodesk.Revit.DB.BaseExportOptions.GetExportLinetypeTable Method

Gets a copy of the line type table.

## Syntax (C#)
```csharp
public ExportLinetypeTable GetExportLinetypeTable()
```

## Returns
The line type table.